import { Link } from "react-router-dom";

function MentorRigister() {
  return (
    <>
      <h1>هل تريد الانضمام كموجه؟</h1>
      <div>
        <span>إليك إرشادات مجتمع Campus !</span>
        <p>
          للاستمرار، يُرجى قراءة وقبول إرشادات المجتمع. يساعدنا ذلك في الحفاظ
          على تجربة موثوقة لجميع أعضاء المجتمع.
        </p>
      </div>
      <div>
        <span>كن محترمًا</span>
        <p>
          نحترم الوقت والطاقة والجهود التي قدمها المجتمع لمنصة Campus؛ ويجب أن
          تعكس تفاعلاتنا هذا الاحترام.
        </p>
      </div>
      <div>
        <span>كن ممتنًا</span>
        <p>
          نقدر فعل الإحسان ومشاركة الخبرات، وما نتعلمه وننموه من خلال دروس
          وتجارب الآخرين.
        </p>
      </div>
      <div>
        <span>تفاعل بإيجابية</span>
        <p>
          سنرد الجميل بالطاقة والجهد، من خلال الالتزام بالحضور، والتفاعل الجاد،
          وتقديم أفضل ما لدينا.
        </p>
      </div>
      <Link to={"/joinAsMentor/mentorRegisterForm"}>موافق</Link>
    </>
  );
}

export default MentorRigister;
